
public class Hello {

	public static void main(String[] args) {
		System.out.println("Hello Java!!");
//		컴파일 단계는 이진 파일을 만들어서 확장자를 만듬
//		운영체제에 따라 이진수의 해석이 달라짐
//		윈도우의 경우 잘 만들어 지지만 리눅스나 맥은 달라 질수 있음
//		소스 파일에서 다시 바꿔주어야 한다
//		하지만 자바는 컴파일 하고나면 클래스 파일이 만들어 지는데 완벽한 이진 파일이 아니라 어디서든 실행 가능
//		아무리 기계어라 바꿔야 되는데 클래스 파일을 실행 시키는 시점에 이진 형태로 바꾸어서 실행한다
//		배포에 큰 장점을 가지는 자바
//		플랫폼 디펜던트 : 자바 클래스 파일의 실행환경이다 컴파일 단계를 보지 않고 자동으로 만들어준다
//		bin 밑에 파일이 실행됨
//		저장 했는지 확인해야 클래스 파일이 만들어줌
		
		

	}

}
